## Darlene Phan
September 22

### Imports and connections

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import json, os
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
#credentials
with open('/Users/darlenephan/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['user', 'login'])

In [3]:
#create connection str
connection_str = f"mysql+pymysql://{login['user']}:{login['login']}@localhost/movies_db"

In [4]:
#onnection between python and mysql
engine = create_engine(connection_str)

In [5]:
#create database. make sure connection_str ends with database name
if database_exists(connection_str) == False:
    create_database(connection_str)
else: print('Database already exists. ')

Database already exists.

In [6]:
#confirm database was created
database_exists(connection_str)

True

#### Import Dataframes

In [7]:
df_ratings = pd.read_csv('Data/ratings.csv.gz')
df_basics = pd.read_csv('Data/title_basics.csv.gz')

display(df_ratings.head(),df_basics.head())

      tconst  averageRating  numVotes
0  tt0000001            5.7      1910
1  tt0000002            5.8       256
2  tt0000003            6.5      1715
3  tt0000004            5.6       169
4  tt0000005            6.2      2529

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

### Part 1 (Normalizing and creating tables)

#### Title Genres Table
- title_genres: with the columns
    - tconst
    - genre_id

In [8]:
#splitting genres into list
df_basics['genres_split'] = df_basics['genres'].str.split(',')
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [9]:
#check type
type(df_basics.loc[0,'genres_split'])

list

In [10]:
#explode genres into individual rows
exploded_genres = df_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
82818,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
82818,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
82818,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
82819,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
82819,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [11]:
#retrieve unique categories from columns
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [12]:
#create title_genres table from exploded_genres dataframe
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [13]:
#creating genre mapper
#genre encoding 
genre_ints = range(len(unique_genres))
#creating mapper
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [14]:
#make new int genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop(columns='genres_split', inplace=True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

#### Genres Table

In [15]:
#convert genre map dictionary into a dataframe
genre_lookup = pd.DataFrame({'Genre_name': genre_map.keys(),
                                                            'Genre_id': genre_map.values()})
genre_lookup.head()

  Genre_name  Genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Part 2 (creating db and assigning primary key)

#### basic df with tconst as the primary key.

##### Creating a database schema for to_sql

In [16]:
df_basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]

In [17]:
df_basics.drop(columns=['titleType', 'originalTitle', 'isAdult','genres', 'genres_split'], inplace=True)
df_basics.head(1)

      tconst    primaryTitle  startYear  endYear  runtimeMinutes
0  tt0035423  Kate & Leopold       2001      NaN             118

In [18]:
df_basics.columns

Index(['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes'], dtype='object')

In [19]:
#calculate max string lengths
#import
from sqlalchemy.types import*
#calculate max string for object columns
key_len = df_basics['tconst'].fillna('').map(len).max()
title_len = df_basics['primaryTitle'].fillna('').map(len).max()

#create schema 
df_schema = {
    'tconst': String(key_len+1), 
    'primaryTitle': Text(title_len+1), 
    'startYear': Float(), 
    'endYear': Float(), 
    'runtimeMinutes': Integer()
}

##### Run df.to_sql with the dtype argument

In [20]:
#save to sql
df_basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False)

82820

##### Run query to add Primary key

In [21]:
#use the sqlalchemy engine to update the table and set the desired column as the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

#### Title df - Create database and schema

In [22]:
df_ratings.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1910
1  tt0000002            5.8       256

In [23]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1261423 entries, 0 to 1261422
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1261423 non-null  object
 1   averageRating  1261423 non-null  float64
 2   numVotes       1261423 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.9+ MB

In [24]:
df_ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [25]:
#create schema

#calculate max string length for object column
key_len = df_ratings['tconst'].fillna('').map(len).max()

#create schema
df_schema = {
    'tconst': String(key_len+1), 
    'averageRating': Float(), 
    'numVotes': Integer()
}

In [26]:
df_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

In [27]:
#dave to sql
df_ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists='replace', index=False)

1261423

In [28]:
#use the sqlalchemy engine to update the table and set the desired column as the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

#### Title Genres df - Create database and schema

In [29]:
title_genres.head(2)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9

In [30]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 154746 entries, 0 to 82819
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    154746 non-null  object
 1   genre_id  154746 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [31]:
#create schema

#calculate max string length for object column
key_len = title_genres['tconst'].fillna('').map(len).max()

#create schema
df_schema = {
    'tconst': String(key_len+1), 
    'genre_id': Integer()
}

In [32]:
#save to sql
#do not set a primary key
title_genres.to_sql('title_genres', engine, dtype=df_schema, if_exists='replace', index=False)

154746

#### Genres df - Create database and schema

In [33]:
genre_lookup.head(2)

  Genre_name  Genre_id
0     Action         0
1      Adult         1

In [34]:
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_name  26 non-null     object
 1   Genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [35]:
#create schema

#calculate max string length for object column
key_len = genre_lookup['Genre_name'].fillna('').map(len).max()

#create schema
df_schema = {
    'Genre_name': String(key_len+1), 
    'Genre_id': Integer()
}

In [36]:
#save to sql
#do not set a primary key
genre_lookup.to_sql('genres', engine, dtype=df_schema, if_exists='replace', index=False)

26

#### TMDB Data - Create database and schema

In [44]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_data.head()

,imdb,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,tt0113026,en,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,NaN,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,tt0113092,en,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,NaN,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,tt0116391,hi,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.000,0.0,NaN
4,NaN,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,tt0118694,cn,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,1978.0,PG

In [45]:
#dropping columns we don't need
tmdb_df = tmdb_data[['imdb_id', 'budget', 'revenue', 'certification']].copy()
tmdb_df.head()

     imdb_id      budget     revenue certification
0        NaN         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG

In [46]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2491 entries, 0 to 2490
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2490 non-null   object
 1   budget         2490 non-null   float64
 2   revenue        2490 non-null   float64
 3   certification  793 non-null    object
dtypes: float64(2), object(2)
memory usage: 78.0+ KB

In [51]:
#examining null row
tmdb_df.iloc[0]

imdb_id          NaN
budget           NaN
revenue          NaN
certification    NaN
Name: 0, dtype: object

In [53]:
tmdb_df = tmdb_df.drop(0)
tmdb_df.shape

(2490, 4)

In [54]:
#create schema

#calculate max string length for object column
key_len = tmdb_df['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_df['certification'].fillna('').map(len).max()

#create schema
df_schema = {
    'imdb_id': String(key_len+1),
    'budget': Float(),
    'revenue': Float(),
    'certification': String(cert_len+1)
    
}

In [55]:
#save to sql 
tmdb_df.to_sql('tmdb_data', engine, dtype=df_schema, if_exists='replace', index=False)

2490

In [56]:
#assign and update primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

### Part 3 SQL query

In [58]:
q = """
SHOW TABLES
"""
pd.read_sql(q, engine)

  Tables_in_movies_db
0              genres
1        title_basics
2        title_genres
3       title_ratings
4           tmdb_data

In [60]:
q = """
SELECT *
FROM genres
LIMIT 5
"""
pd.read_sql(q, engine)

  Genre_name  Genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [61]:
q = """
SELECT *
FROM title_basics
LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [62]:
q = """
SELECT *
FROM title_genres
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [63]:
q = """
SELECT * 
FROM title_ratings
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1910
1  tt0000002            5.8       256
2  tt0000003            6.5      1715
3  tt0000004            5.6       169
4  tt0000005            6.2      2529

In [64]:
q = """
SELECT *
FROM tmdb_data
LIMIT 5
"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None